def checkberdee(phone_number=0):
    # สร้างตัวแปรไว้เก็บผลรวมของเบอร์ผู้ใช้
    total = 0

    # สร้างตัวแปรไว้ทำนายผลรวมของเบอร์ผู้ใช้
    predict = ""

    # วนลูปเพื่อหาผลรวมของเบอร์ผู้ใช้  
    for phone in phone_number:
        total += int(phone)

    # ทำนายผลรวมของเบอร์ผู้ใช้
    if total in (9, 14, 15, 19, 23, 24, 32, 36, 40, 41, 42, 44, 45, 46, 50, 51, 54, 55, 56, 59):
        predict = "เบอร์ของคุณดีมาก"
    elif total in (63, 64, 65, 69, 79):
        predict = "โอกาสประสบผลสำเร็จสูง อุปสรรคน้อย"
    elif total in (10, 13, 16, 18, 20, 22, 25, 26, 28, 31, 35, 38, 39, 47, 49, 52, 53, 57):
        predict = "ดีปานกลาง"
    elif total in (58, 60, 6162, 66, 68, 74, 75):
        predict = "เหนื่อย มีอุปสรรค แต่ยังมีโอกาสประสบผลสำเร็จ"
    elif total in (11, 12, 17, 21, 27, 29, 30, 33, 34, 37, 43, 48, 67, 70, 71, 72, 73):
        predict = "ไม่ดีให้โทษ"
    elif total in (76, 77, 78, 80):
        predict = "เหนื่อยมาก อุปสรรคมาก เจอปัญหารุมเร้า เกิดอุบัติเหตุชีวิตไม่จบไม่สิ้น"
    else:
        predict = "ไม่พบข้อมูล"
    return predict

# เรียกใช้งานฟังก์ชัน checkberdee()
phone = input("กรุณากรอกเบอร์โทรศัพท์ของคุณ: ")
print(checkberdee(phone))
